[{"type": "product", "id": 1, "text": "Product: Smartphone X. Description: Latest smartphone with 6.5 inch display, 128GB storage, and dual camera.. Price: $699.99. SKU: PHN-X-128."}, {"type": "product", "id": 2, "text": "Product: Laptop Pro. Description: Powerful laptop with 16GB RAM, 512GB SSD, and dedicated graphics card.. Price: $1299.99. SKU: LPT-PRO-512."}, {"type": "product", "id": 3, "text": "Product: Wireless Earbuds. Description: Premium wireless earbuds with noise cancellation and 8 hours battery life.. Price: $129.99. SKU: AUD-WL-NC."}, {"type": "product", "id": 4, "text": "Product: Smart Watch. Description: Fitness tracker with heart rate monitor, GPS and 5-day battery life.. Price: $199.99. SKU: WCH-SMT-5D."}, {"type": "product", "id": 5, "text": "Product: Digital Camera. Description: 24MP digital camera with 4K video recording and 30x optical zoom.. Price: $549.99. SKU: CAM-DIG-24MP."}, {"type": "faq", "id": 1, "text": "Questions: How long does shipping take? Answer: Standard shipping takes 3-5 business days. Express shipping takes 1-2 business days."}, {"type": "faq", "id": 2, "text": "Questions: What is your return policy? Answer: You can return items within 30 days of delivery for a full refund."}, {"type": "faq", "id": 3, "text": "Questions: Do you ship internationally? Answer: Yes, we ship to most countries worldwide. International shipping typically takes 7-14 business days."}, {"type": "faq", "id": 4, "text": "Questions: How can I track my order? Answer: You can track your order by logging into your account or using the tracking number provided in your shipping confirmation email."}, {"type": "faq", "id": 5, "text": "Questions: Are your products covered by warranty? Answer: Yes, all our electronic products come with a 1-year manufacturer warranty."}, {"type": "order", "id": 1, "text": "Order #ORD-2023-0001 by Michael Brown. Status: delivered. Total: $3549.95. Items: 2 X Smart Watch; 2 X Laptop Pro; 1 X Digital Camera"}, {"type": "order", "id": 2, "text": "Order #ORD-2023-0002 by Sarah Johnson. Status: pending. Total: $3899.97. Items: 3 X Laptop Pro"}, {"type": "order", "id": 3, "text": "Order #ORD-2023-0003 by Sarah Johnson. Status: cancelled. Total: $5099.94. Items: 2 X Laptop Pro; 2 X Smartphone X; 2 X Digital Camera"}, {"type": "order", "id": 4, "text": "Order #ORD-2023-0004 by John Smith. Status: delivered. Total: $1099.98. Items: 1 X Digital Camera; 1 X Digital Camera"}, {"type": "order", "id": 5, "text": "Order #ORD-2023-0005 by John Smith. Status: pending. Total: $3799.92. Items: 3 X Smart Watch; 2 X Digital Camera; 3 X Smartphone X"}, {"type": "order", "id": 6, "text": "Order #ORD-2023-0006 by Michael Brown. Status: cancelled. Total: $899.98. Items: 1 X Smartphone X; 1 X Smart Watch"}, {"type": "order", "id": 7, "text": "Order #ORD-2023-0007 by Emily Wilson. Status: pending. Total: $2849.95. Items: 3 X Smartphone X; 1 X Smart Watch; 1 X Digital Camera"}, {"type": "order", "id": 8, "text": "Order #ORD-2023-0008 by David Lee. Status: pending. Total: $399.98. Items: 2 X Smart Watch"}, {"type": "order", "id": 9, "text": "Order #ORD-2023-0009 by Michael Brown. Status: pending. Total: $2499.96. Items: 2 X Digital Camera; 2 X Smartphone X"}, {"type": "order", "id": 10, "text": "Order #ORD-2023-0010 by Michael Brown. Status: delivered. Total: $3749.94. Items: 1 X Smartphone X; 3 X Digital Camera; 2 X Smartphone X"}]